; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 435257 2 2 3 6 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	spectrograph2 - mode
	infrared1 - mode
	Star0 - direction
	Star2 - direction
	Star3 - direction
	Star1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Phenomenon6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Phenomenon6)
	(have_image Phenomenon6 spectrograph2)
	(have_image Planet7 spectrograph2)
))

)

; plan
1. (turn_to satellite0 star3 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star3)
   goals met: 1 of 4
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 4
3. (turn_to satellite1 planet7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet7)
   goals met: 1 of 4
4. (turn_to satellite1 groundstation4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 4
5. (turn_to satellite0 phenomenon6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 4
6. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 4
7. (turn_to satellite0 star3 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star3)
   goals met: 1 of 4
8. (turn_to satellite1 planet7 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet7)
   goals met: 1 of 4
9. (turn_to satellite0 phenomenon6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 4
10. (take_image satellite1 planet7 instrument1 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 1 of 4
11. (turn_to satellite0 star3 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star3)
   goals met: 2 of 4
12. (turn_to satellite1 phenomenon6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 4
13. (take_image satellite1 phenomenon6 instrument1 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 4 of 4
